{
    "id": "yanka_kupala",
    "yearsOfLife": "25 июня 1882 – 28 июня 1942",
    "photo": "Yanka_Kupala.jpg",
    "video": "9FZehV2qJTk",
    "mapId": "1M2HXc1LeM9Qq8bOl3R7ueYmuLMgfnzB0",
    "ru": {
        "name": "Янка Купала",
        "location": "Минск",
        "bio": "Белорусский поэт и переводчик, драматург, публицист. Классик белорусской литературы. Народный поэт БССР (1925). Академик АН БССР (1928) и АН УССР (1929). Лауреат Сталинской премии первой степени (1941).",
        "timeline": [
            {
                "time": "1882",
                "title": "Рождение",
                "desc": "Родился 25 июня (7 июля) 1882 года в деревне Вязынка (ныне Молодечненского района Минской области Белоруссии) в белорусской католической семье Доминика Онуфриевича Луцевича и Бенигны Ивановны Луцевич (дев. Волосевич)."
            },
            {
                "time": "1898",
                "title": "Учеба",
                "desc": "В 1898 году закончил народное училище в местечке Беларуч."
            },
            {
                "time": "1902",
                "title": "Работа",
                "desc": "После смерти отца в 1902 году работал домашним учителем, писарем в помещичьем имении, приказчиком и на других работах. Хотя тяжёлая работа отнимала у Ивана много времени, ему удавалось выкраивать свободные часы на занятие самообразованием."
            },
            {
                "time": "1903-1904",
                "title": "Первые произведения",
                "desc": "Первые произведения Купалы – несколько лирических стихотворений на польском языке, опубликованы в 1903-1904 годах в журнале «Ziarno» («Зерно») под псевдонимом «К-а». Первое стихотворение на белорусском языке – «Мая доля» датируется 15 июля 1904 года."
            },
            {
                "time": "1908-1909",
                "title": "Вильня",
                "desc": "В 1908-1909 годы жил в Вильне, где работал в редакции первой белорусской газеты «Наша Ніва». Там же познакомился с будущей женой – Владиславой Станкевич – и актрисой Павлиной Мядёлкой, которой Купала одно время был увлечён и в честь которой назвал героиню своей первой пьесы – комедии «Павлинка». В это же время написано самое известное стихотворение поэта «А кто там идёт?» (первоначальное заглавие «Беларусы»). В 1908 году в Петербурге издан первый сборник Купалы под названием «Жалейка» («Дудочка»)."
            },
            {
                "time": "1909-1913",
                "title": "Санкт-Петербург",
                "desc": "В 1909-1913 годах начинающий поэт учился в Санкт-Петербурге на подготовительных общеобразовательных курсах А. Черняева."
            },
            {
                "time": "1914",
                "title": "Главный редактор",
                "desc": "В 1914 году основатели газеты Александр Власов и братья Иван и Антон Луцкевичи предложили Янке Купале должность главного редактора, и он с охотой согласился, отдав этой работе два года. К этому времени им уже были созданы произведения, которые станут бессмертными: поэмы «Адвечная песня» и «Сон на кургане», пьеса «Паўлінка»."
            },
            {
                "time": "1915",
                "title": "Москва",
                "desc": "В сентябре 1915 году Янка Купала поступил в Московский городской народный университет имени А. Л. Шанявского, однако его намерениям продолжить учёбу помешала всеобщая мобилизация, объявленная в связи с наступлением Первой мировой войны."
            },
            {
                "time": "1916-1918",
                "title": "Первая мировая война",
                "desc": "Уже в начале 1916 года поэта-студента призвали в армию и тот поступил в дорожно-строительный отряд, в составе которого работал вплоть до наступления событий Октябрьской революции. В это время Янка Купала обосновался в Смоленске, работал в сфере строительства дорог, где его и застала врасплох революционная стихия. В период с 1916 по 1918 годы им не было создано ни одного произведения."
            },
            {
                "time": "1919",
                "title": "Минск",
                "desc": "В 1919 году он переезжает в Минск. События Советско-польской войны существенно не повлияли на образ жизни поэта: он пережил годичную польскую оккупацию Минска, в котором и остался жить до следующей войны."
            },
            {
                "time": "1920-1941",
                "title": "Творчество",
                "desc": "На протяжении двух следующих десятилетий (вплоть до наступления Великой Отечественной войны) выходили в свет следующие лирические сборники белорусского поэта: «Наследство» (1922), «Безымянное» (1925), «Песня строительству» (1936), «Белоруссии орденоносной» (1937), «От сердца» (1940), поэмы «Над рекой Орессой» (1933), «Тарасова доля» (1939) и некоторые другие. В 1930 году Янка Купала предпринял попытку самоубийства, однако жена спасла его от гибели. Награды и премии: Сталинская премия первой степени (1941) – за сборник стихов «От сердца». Орден Ленина (31.01.1939)."
            },
            {
                "time": "1941-1942",
                "title": "Последние годы",
                "desc": "В годы войны получила популярность яркая публицистика Янки Купалы, способная зажечь людей для сражения - его новым патриотическим стихотворениям в этот период присуща антифашистская направленность. Уехав из Минска, Янка Купала обосновался в Печищах, маленьком населённом пункте недалеко от Казани, чтобы обрести покой для погружения в антифашистскую публицистику.  Янка Купала скончался 28 июня 1942 года в гостинице «Москва». Поэт сорвался в лестничный пролёт между 9-м и 10-м этажами гостиницы, смерть была мгновенной."
            }
        ],
        "works_list": [
            {
                "group": "Сборники стихов",
                "works": [
                    { "name": "«Жалейка»", "date": "1908" },
                    { "name": "«Гусляр»", "date": "1910" },
                    { "name": "«Дорогой жизни»", "date": "1913" },
                    { "name": "«Наследие»", "date": "1922" },
                    { "name": "«Безымянное»", "date": "1925" },
                    { "name": "«Отцветание»", "date": "1930" },
                    { "name": "«Песня строительству»", "date": "1936" },
                    { "name": "«Белоруссии орденоносной»", "date": "1937" },
                    { "name": "«От сердца»", "date": "1940" },
                    { "name": "«Белорусским партизанам»", "date": "1942" }
                ]
            },
            {
                "group": "Поэмы",
                "works": [
                    { "name": "«Зимой», «Никому», «Калека», «Расплата любовью»", "date": "1907" },
                    { "name": "«В Пилиповку», «За что?», «Извечная песня»", "date": "1908" },
                    { "name": "«Курган», «Сон на кургане»", "date": "1910" },
                    { "name": "«В Сочельник», «На Дзяды»", "date": "1911" },
                    { "name": "«Бондаровна», «Могила льва», «Она и я», «На привале»", "date": "1913" },
                    { "name": "«Безымянное»", "date": "1924" },
                    { "name": "«Из юбилейных настроений»", "date": "1927" },
                    { "name": "«Над рекой Орессой»", "date": "1933" },
                    { "name": "«Тарасова доля»", "date": "1939" }
                ]
            },
            {
                "group": "Пьесы",
                "works": [
                    { "name": "«Павлинка»", "date": "1912" },
                    { "name": "«Примаки», «Раскиданное гнездо» ", "date": "1913" },
                    { "name": "«Здешние» ", "date": "1922" }
                ]
            }
        ]
    },
    "be": {
        "name": "Янка Купала",
        "location": "Мінск",
        "bio": "Беларускі паэт, драматург, публіцыст, перакладчык, класік беларускай літаратуры, адзін з заснавальнікаў новай беларускай літаратуры і літаратурнай мовы. Народны паэт Беларусі (1925). Акадэмік АН БССР (1928), АН УССР (1929). Лаўрэат Дзяржаўнай прэміі СССР (1941) за зборнік «Ад сэрца».",
        "timeline": [
            {
                "time": "1882",
                "title": "Нараджэнне",
                "desc": "Іван Луцэвіч нарадзіўся 7 ліпеня 1882 года (па новым стылі) у фальварку Вязынка Вілейскага павета ў сям'і арандатара Дамініка Ануфрыевіча Луцэвіча і яго жонкі Бянігны Валасевіч."
            },
            {
                "time": "1898",
                "title": "Вучоба",
                "desc": "У 1898 годзе скончыў Бяларуцкае народнае вучылішча."
            },
            {
                "time": "1902",
                "title": "Праца",
                "desc": "Пасля смерці бацькі (1902) працаваў на гаспадарцы, потым хатнім настаўнікам, пісарам у судовага следчага ў Радашковічах і на іншых працах."
            },
            {
                "time": "1903-1904",
                "title": "Першыя творы",
                "desc": "Першыя творы Купалы – некалькі польскамоўных сентыментальных вершаў, надрукаваныя ў 1903-1904 у часопісе «Ziarno» («Зерне») пад псеўданімам «К-а». Першы верш на беларускай мове – «Мая доля» датуецца 15.7.1904."
            },
            {
                "time": "1908-1909",
                "title": "Вільня",
                "desc": "У 1908-1909 гады жыў у Вільні, дзе працаваў у рэдакцыі першай беларускай газеты «Наша Ніва». Там жа пазнаёміўся з будучай жонкай - Уладзіславай Станкевіч – і актрысай Паўлінай Мядёлкай, якой Купала адзін час быў захоплены і ў гонар якой назваў гераіню сваёй першай п'есы – камедыі «Паўлінка». У гэты ж час напісана самы вядомы верш паэта «А хто там ідзе?» (Першапачатковая назва «Беларусы»). У 1908 годзе ў Пецярбургу выдадзены першы зборнік Купалы пад назвай «Жалейка»."
            },
            {
                "time": "1909-1913",
                "title": "Санкт-Пецярбург",
                "desc": "У 1909-1913 гадах пачатковец паэт вучыўся ў Санкт-Пецярбургу на падрыхтоўчых агульнаадукацыйных курсах А. Чарняева."
            },
            {
                "time": "1914",
                "title": "Галоўны рэдактар",
                "desc": "У 1914 годзе заснавальнікі газеты Аляксандр Уласаў і браты Іван і Антон Луцкевічы прапанавалі Янку Купалу пасаду галоўнага рэдактара, і ён з ахвотай згадзіўся, аддаўшы гэтай працы два гады. Да гэтага часу ім ужо былі створаны творы, якія стануць несмяротнымі: паэмы «Адвечная песня» і «Сон на кургане», п'еса «Паўлінка»."
            },
            {
                "time": "1915",
                "title": "Масква",
                "desc": "У верасні 1915 года Янка Купала паступіў у Маскоўскі гарадскі народны універсітэт імя А. Л. Шаняўскага, аднак яго намерам вучыцца перашкодзіла ўсеагульная мабілізацыя, аб'яўленая ў сувязі з надыходам Першай сусветнай вайны."
            },
            {
                "time": "1916-1918",
                "title": "Першая сусветная вайна",
                "desc": "Ужо ў пачатку 1916 года паэта-студэнта прызвалі ў армію і той паступіў у дарожна-будаўнічы атрад, у складзе якога працаваў аж да наступлення падзей Кастрычніцкай рэвалюцыі. У гэты час Янка Купала пасяліўся ў Смаленску, працаваў у сферы будаўніцтва дарог, дзе яго і заспела знянацку рэвалюцыйная стыхія. У перыяд з 1916 па 1918 гады ім не было створана ніводнага твора."
            },
            {
                "time": "1919",
                "title": "Менск",
                "desc": "У 1919 годзе ён пераязджае ў Менск. Падзеі Савецка-польскай вайны істотна не паўплывалі на лад жыцця паэта: ён перажыў гадавую польскую акупацыю Мінска, у якім і застаўся жыць да наступнай вайны."
            },
            {
                "time": "1920-1941",
                "title": "Творчасць",
                "desc": "На працягу двух наступных дзесяцігоддзяў (аж да наступлення Вялікай Айчыннай вайны) выходзілі ў свет наступныя лірычныя зборнікі беларускага паэта: «Спадчына» (1922), «Безназоўнае» (1925), «Песня будаўніцтву» (1936), «Беларусі ардэнаноснай» (1937), «Ад сэрца»(1940), паэмы «Над ракой Арэсы» (1933), «Тарасова доля» (1939) і некаторыя іншыя. У 1930 годзе Янка Купала зрабіў спробу самагубства, аднак жонка выратавала яго ад пагібелі. Ўзнагароды і прэміі: Сталінская прэмія першай ступені (1941) – за зборнік вершаў «Ад сэрца». Ордэн Леніна (1939/01/31)."
            },
            {
                "time": "1941-1942",
                "title": "Апошнія гады",
                "desc": "У гады вайны атрымала папулярнасць яркая публіцыстыка Янкі Купалы, здольная запаліць людзей дзеля бітваў – яго новым патрыятычным вершам у гэты перыяд ўласцівая антыфашысцкая накіраванасць. З'ехаўшы з Мінска, Янка Купала пасяліўся ў Печышча, маленькім населеным пункце недалёка ад Казані, каб здабыць супакой для апускання ў антыфашысцкую публіцыстыку. Янка Купала памёр 28 чэрвеня 1942 гады ў гасцініцы «Масква». Паэт сарваўся ў лесвічны пралёт паміж 9-м і 10-м паверхамі гасцініцы, смерць была імгненнай."
            }
        ],
        "works_list": [
            {
                "group": "Зборнікі вершаў",
                "works": [
                    { "name" : "«Жалейка»", "date": "1908"},
                    { "name" : "«Гусляр»", "date": "1910"},
                    { "name" : "«Шляхам жыцьця»", "date": "1913"},
                    { "name" : "«Спадчына»", "date": "1922"},
                    { "name" : "«Безназоўнае»", "date": "1925"},
                    { "name" : "«Адцьвітаньне»", "date": "1930"},
                    { "name" : "«Беларусі ардэнаноснай»", "date": "1936"},
                    { "name" : "«Белоруссии орденоносной»", "date": "1937"},
                    { "name" : "«Ад сэрца»", "date": "1940"},
                    { "name" : "«Беларускім партызанам»", "date": "1942"}
                ]
            },
            {
                "group": "Паэмы",
                "works": [
                    { "name" : "«Зімою», «Нікому», «Калека», «Расплата любовью»", "date": "1907"},
                    { "name" : "«У Піліпаўку», «За што?», «Адвечная песьня ў ХІІ-ці праявах»", "date": "1908"},
                    { "name" : "«Курган», «Сон на кургане»", "date": "1910"},
                    { "name" : "«На Куццю», «На Дзяды»", "date": "1911"},
                    { "name" : "«Бондароўна», «Магіла льва», «Яна і я», «На папасе»", "date": "1913"},
                    { "name" : "«Безназоўнае»", "date": "1924"},
                    { "name" : "«З угодкавых настрояў»", "date": "1927"},
                    { "name" : "«Над ракой Арэсай»", "date": "1933"},
                    { "name" : "«Тарасова доля»", "date": "1939"}
                ]
            },
            {
                "group": "П'есы",
                "works": [
                    { "name" : "«Паўлінка»", "date": "1912"},
                    { "name" : "«Прымакі», «Раскіданае гняздо»", "date": "1913"},
                    { "name" : "«Тутэйшыя» ", "date": "1922"}
                ]
            }
        ]
    },
    "en": {
        "name": "Yanka Kupala",
        "location": "Minsk",
        "bio": "А Belarusian poet and writer. Kupala is considered one of the greatest Belarusian-language writers of the 20th century.",
        "timeline": [
            {
                "time": "1882",
                "title": "Birth",
                "desc": "Kupala was born on July 7, 1882 in Viazynka, a folwark settlement near Maladzyechna. His family was noble, although both of Kupala's parents were employed as tenant farmers at the folwark."
            },
            {
                "time": "1898",
                "title": "Study",
                "desc": "Kupala received a traditional Belarusian education, completing his studies in 1898."
            },
            {
                "time": "1902",
                "title": "Work",
                "desc": "Following the death of his father in 1902, Kupala worked a variety of short-term jobs, including as a tutor, a shop assistant, and a record keeper."
            },
            {
                "time": "1903-1904",
                "title": "First works",
                "desc": "Kupala's first serious literary attempt was Ziarno, a Polish-language sentimental poem which he completed around 1903–1904 under the pseudonym 'K-a.' His first Belarusian-language work ('Мая доля') was dated July 15, 1904."
            },
            {
                "time": "1908-1909",
                "title": "Vilna",
                "desc": "In the years 1908-1909 he lived in Vilna, where he worked in the editorial office of the first Belarusian newspaper Nasha Niva. The same year the first published collection of his poems, «Жалейка» (The Little Flute)."
            },
            {
                "time": "1909-1913",
                "title": "Saint Petersburg",
                "desc": "Kupala left for Saint Petersburg in 1909. The subsequent year saw the publication of several works, including the poem «Адвечная песьня» (Eternal Song), which appeared as a book in St. Petersburg in July 1910. «Сон на кургане» (Dream on a Barrow) – completed in August 1910. Kupala left St. Petersburg and returned to Vilnius in 1913."
            },
            {
                "time": "1914",
                "title": "Editor-in-chief",
                "desc": "In 1914, the founders of the newspaper, Alexander Vlasov, and the brothers Ivan and Anton Lutskevich offered Yanka Kupala the position of editor-in-chief, and he readily agreed."
            },
            {
                "time": "1915",
                "title": "Moscow",
                "desc": "In September 1915, Yanka Kupala entered the Moscow City People’s University named after A. L. Shanyavsky."
            },
            {
                "time": "1916-1918",
                "title": "World War I",
                "desc": "Already in early 1916, a poet was drafted into the army. At this time, Yanka Kupala settled in Smolensk, worked in the field of road construction. In the period from 1916 to 1918, they did not create a single work."
            },
            {
                "time": "1919",
                "title": "Minsk",
                "desc": "In 1919, he moved to Minsk. He survived the annual Polish occupation of Minsk, where he remained to live until the next war."
            },
            {
                "time": "1920-1941",
                "title": "Creation",
                "desc": "Over the next two decades (until the Great Patriotic War began), the following lyric collections of the Belarusian poet were published: «Наследство» (Inheritance) (1922), «Безымянное» (Nameless) (1925), «Песня строительству» (Song of Construction) (1936), «От сердца» (From the Heart) (1940), the poem «Над рекой Орессой» (Above the River Oressa) (1933) and some others. In 1930, Yanka Kupala attempted suicide, but his wife saved him from death."
            },
            {
                "time": "1941-1942",
                "title": "Last years",
                "desc": "Kupala was awarded the Order of Lenin in 1941 for the poetry collection «Ад сэрца» (From the Heart). With the Occupation of Belarus by Nazi Germany in 1941, because of being very ill he moved to Moscow and then to Tatarstan. Even from there he wrote poems supporting the Belarusian partisans fighting against Nazi Germany. He died in Moscow in 1942, aged 59, having fallen down the stairwell in Hotel Moskva."
            }
        ],
        "works_list": [
            {
                "group": "Poetry collections",
                "works": [
                    { "name" : "«Жалейка»", "date": "1908"},
                    { "name" : "«Гусляр»", "date": "1910"},
                    { "name" : "«Шляхам жыцьця»", "date": "1913"},
                    { "name" : "«Спадчына»", "date": "1922"},
                    { "name" : "«Безназоўнае»", "date": "1925"},
                    { "name" : "«Адцьвітаньне»", "date": "1930"},
                    { "name" : "«Беларусі ардэнаноснай»", "date": "1936"},
                    { "name" : "«Белоруссии орденоносной»", "date": "1937"},
                    { "name" : "«Ад сэрца»", "date": "1940"},
                    { "name" : "«Беларускім партызанам»", "date": "1942"}
                ]
            },
            {
                "group": "Poems",
                "works": [
                    { "name" : "«Зімою», «Нікому», «Калека», «Расплата любовью»", "date": "1907"},
                    { "name" : "«У Піліпаўку», «За што?», «Адвечная песьня ў ХІІ-ці праявах»", "date": "1908"},
                    { "name" : "«Курган», «Сон на кургане»", "date": "1910"},
                    { "name" : "«На Куццю», «На Дзяды»", "date": "1911"},
                    { "name" : "«Бондароўна», «Магіла льва», «Яна і я», «На папасе»", "date": "1913"},
                    { "name" : "«Безназоўнае»", "date": "1924"},
                    { "name" : "«З угодкавых настрояў»", "date": "1927"},
                    { "name" : "«Над ракой Арэсай»", "date": "1933"},
                    { "name" : "«Тарасова доля»", "date": "1939"}
                ]
            },
            {
                "group": "Plays",
                "works": [
                    { "name" : "«Паўлінка»", "date": "1912"},
                    { "name" : "«Прымакі», «Раскіданае гняздо»", "date": "1913"},
                    { "name" : "«Тутэйшыя» ", "date": "1922"}
                ]
            }
        ]
    },
    "gallery": ["Yanka_Kupala_1.jpg","Yanka_Kupala_2.jpg","Yanka_Kupala_3.jpg","Yanka_Kupala_4.jpg","Yanka_Kupala_5.jpg","Yanka_Kupala_6.jpg","Yanka_Kupala_7.jpg","Yanka_Kupala_8.jpg","Yanka_Kupala_9.jpg"]
}
